Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The result is the character specified by the three-digit octal number in the range 000 to 777 (but best to not use above 077, see next paragraph).
es_es: El resultado es el carácter especificado por el número octal de tres dígitos en el rango 000 a 777 (pero es mejor no superar el 077, ver siguiente párrafo).

source: =item vector flag
es_es: =item vector de banderas

source: While some modules retain uppercase or hyphenated argument keys for historical reasons or as a matter of personal style, most new modules should use simple lower case keys.
es_es: Si bien algunos módulos retienen los argumentos en mayúsculas o con guión por razones históricas o como una cuestión de estilo personal, la mayoría de los nuevos módulos deberían utilizar las claves escritas en minúsculas.

source: "C<< -> >>" is an infix dereference operator, just as it is in C and C++.
es_es: "C<< -> >>" es un operador infijo de desreferencia, tal como es en C y C++.

source: Exchanging signed integers between different platforms works only when all platforms store them in the same format.
es_es: Intercambiando enteros con signo entre distintas plataformas funciona sólo cuando todas las plataformas los almacenan en el mismo formato.

source: From each search string, the rarest character is selected, based on some static frequency tables constructed from some C programs and English text.
es_es: De cada cadena de búsqueda, se selecciona el carácter más raro, en función de algunas tablas de frecuencia estática construidas a partir de algunos programas en C y texto en Inglés.

source: It refers to the pseudo file formed from the files listed on the command line and accessed via the C<< <> >> operator.
es_es: Se refiere a un pseudo archivo formado por los archivos listados en la línea de comandos y accedidos vía el operador C<< <> >>.

source: $hash{get_a_key_for($_)} = $_;
es_es: $hash{una_clave_para($_)} = $_;

source: Which one you pick depends on which of these expressions better reflects the above specification of comments.
es_es: El cuál escoger depende de cuál de estas expresiones refleja mejor la especificación anterior, de esos comentarios.

source: C<when> is analogous to the C<case> keyword in other languages.
es_es: C<when> es análogo a la palabra clave C<case>, de otros lenguajes.

source: The return value is unaffected by any forward declarations of C<&func>.
es_es: El valor devuelto no es afectado por ninguna declaración posterior de C<&func>.

source: Using C<strict> is highly recommended.
es_es: Es muy recomendable usar C<strict>.

source: exec { $args[0] } @args; # safe even with one-arg list
es_es: exec { $args[0] } @args; # seguro incluso con una lista de un argumento

source: This step is listed for completeness only.
es_es: Este paso está aquí descrito solo por completar la documentación.

source: This prints
es_es: Esto imprime

source: C<flock> is Perl's portable file-locking interface, although it locks entire files only, not records.
es_es: C<flock> es el interfaz portable de Perl para e bloqueo de archivo, aunque sólo bloquea archivos enteros, no registros.

source: See L<perl590delta> for the differences between 5.8.0 and 5.9.0.
es_es: Vea L<perl590delta> para las diferencias entre 5.8.0 y 5.9.0.

source: The issue of whether to pass the arguments in a hash or a hashref is largely a matter of personal style.
es_es: La cuestión de si se debe pasar los argumentos en un hash o una referencia a un hash es en gran medida una cuestión de estilo personal.

source: Hints now supports versions 5.*.
es_es: Los consejos ahora son compatibles con las versiones 5.*.

source: Consider this pattern:
es_es: Considere este patrón:

source: No interpolation is performed at this stage.
es_es: No se realiza interpolación en esta etapa.

source: This meant that trying to print, say, chr(0xff), ended up printing the bytes 0xc3 0xbf.
es_es: Esto significaba que intentando imprimir, por ejemplo, chr(0xff), terminaba imprimiendo los bytes 0xc3 0xbf.

source: =head2 More precise warnings
es_es: =head2 Advertencias más precisas

source: =item grep BLOCK LIST X<grep>
es_es: =item grep BLOQUE LISTA X<grep>

source: Weak reference creation is now I<O(1)> rather than I<O(n)>, courtesy of Nicholas Clark.
es_es: La creación de referencias débiles es ahora I<O(1)> en lugar de I<O(n)>, cortesía de Nicholas Clark.

source: =head2 New support for Abstract namespace sockets
es_es: =head2 Nuevo soporte para el espacio de nombres de los sockets Abstract

source: cc: "/usr/include/sys/socket.h", line 505: warning 562:
es_es: cc: "/usr/include/sys/socket.h", line 504: warning 562:

source: 1 "barney"
es_es: 1 "pablo"
